_posts/2013-05-21-Calling-lapack-directly-from-scipy.html
---
title: Calling lapack directly from scipy
date: 2013/05/21 11:28:27
updated: 2013/06/26 18:55:43
categories: linear algebra
tags: 
---


<p>
If the built in linear algebra functions in numpy and scipy do not meet your needs, it is often possible to directly call lapack functions. Here we call a function to solve a set of complex linear equations. The lapack function for this is ZGBSV. The description of this function (<a href="http://linux.die.net/man/l/zgbsv">http://linux.die.net/man/l/zgbsv</a>) is:
</p>

<p>
ZGBSV computes the solution to a complex system of linear equations A * X = B, where A is a band matrix of order N with KL subdiagonals and KU superdiagonals, and X and B are N-by-NRHS matrices. The LU decomposition with partial pivoting and row interchanges is used to factor A as A = L * U, where L is a product of permutation and unit lower triangular matrices with KL subdiagonals, and U is upper triangular with KL+KU superdiagonals. The factored form of A is then used to solve the system of equations A * X = B. 
</p>

<p>
The python signature is (<a href="http://docs.scipy.org/doc/scipy/reference/generated/scipy.linalg.lapack.zgbsv.html#scipy.linalg.lapack.zgbsv">http://docs.scipy.org/doc/scipy/reference/generated/scipy.linalg.lapack.zgbsv.html#scipy.linalg.lapack.zgbsv</a>): 
</p>

<p>
lub,piv,x,info = zgbsv(kl,ku,ab,b,[overwrite_ab,overwrite_b])
</p>

<p>
We will look at an example from <a href="http://www.nag.com/lapack-ex/node22.html">http://www.nag.com/lapack-ex/node22.html</a>.
</p>

<p>
We solve \(A x = b\) with
</p>

<p>
\( 
A = \left(
</p>
\begin{array}{cccc}
   -1.65 + 2.26 i & -2.05 - 0.85 i &  0.97 - 2.84 i &       0        \\
           6.30 i & -1.48 - 1.75 i & -3.99 + 4.01 i &  0.59 - 0.48 i \\
         0        & -0.77 + 2.83 i & -1.06 + 1.94 i &  3.33 - 1.04 i \\
         0        &       0        &  4.48 - 1.09 i & -0.46 - 1.72 i
\end{array}
<p>
       \right)
\)
</p>

<p>
\(
b = \left(
</p>
\begin{array}{cc}
    -1.06 + 21.50 i \\
   -22.72 - 53.90 i \\
    28.24 - 38.60 i \\
   -34.56 + 16.73 i
\end{array}
<p>
       \right).
\)
</p>

<p>
The \(A\) matrix has one lower diagonal (kl = 1) and two upper diagonals (ku = 2), four equations (n = 4) and one right-hand side.
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">import</span> scipy.linalg.lapack <span style="color: #8b0000;">as</span> la

<span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">http://www.nag.com/lapack-ex/node22.html</span>
<span style="color: #8b0000;">import</span> numpy <span style="color: #8b0000;">as</span> np
A = np.array([[-1.65 + 2.26j, -2.05 - 0.85j,  0.97 - 2.84j,  0.0         ],
              [6.30j,         -1.48 - 1.75j, -3.99 + 4.01j,  0.59 - 0.48j],
              [0.0,           -0.77 + 2.83j, -1.06 + 1.94j,  3.33 - 1.04j],
              [0.0,            0.0,           4.48 - 1.09j, -0.46 - 1.72j]])

<span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">construction of Ab is tricky.  Fortran indexing starts at 1, not</span>
<span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">0. This code is based on the definition of Ab at</span>
<span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">http://linux.die.net/man/l/zgbsv. First, we create the Fortran</span>
<span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">indices based on the loops, and then subtract one from them to index</span>
<span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">the numpy arrays.</span>
Ab = np.zeros((5,4),dtype=np.complex)
n, kl, ku = 4, 1, 2

<span style="color: #8b0000;">for</span> j <span style="color: #8b0000;">in</span> <span style="color: #8b0000;">range</span>(1, n + 1):
    <span style="color: #8b0000;">for</span> i <span style="color: #8b0000;">in</span> <span style="color: #8b0000;">range</span>(max(1, j - ku), <span style="color: #8b0000;">min</span>(n, j + kl) + 1):
        Ab[kl + ku + 1 + i - j - 1, j - 1] = A[i-1, j-1]

b = np.array([[-1.06  + 21.50j],
              [-22.72 - 53.90j],
              [28.24 - 38.60j],
              [-34.56 + 16.73j]])

lub, piv, x, info = la.flapack.zgbsv(kl, ku, Ab, b)

<span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">compare to results at http://www.nag.com/lapack-ex/examples/results/zgbsv-ex.r</span>
<span style="color: #8b0000;">print</span> <span style="color: #228b22;">'x = '</span>,x
<span style="color: #8b0000;">print</span> <span style="color: #228b22;">'info = '</span>,info

<span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">check solution</span>
<span style="color: #8b0000;">print</span> <span style="color: #228b22;">'solved: '</span>,np.all(np.dot(A,x) - b &lt; 1e-12)

<span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">here is the easy way!!!</span>
<span style="color: #8b0000;">print</span> <span style="color: #228b22;">'\n\nbuilt-in solver'</span>
<span style="color: #8b0000;">print</span> np.linalg.solve(A,b)
</pre>
</div>

<pre class="example">
x =  [[-3.+2.j]
 [ 1.-7.j]
 [-5.+4.j]
 [ 6.-8.j]]
info =  0
solved:  True


built-in solver
[[-3.+2.j]
 [ 1.-7.j]
 [-5.+4.j]
 [ 6.-8.j]]
</pre>

<p>
Some points of discussion. 
</p>

<ol class="org-ol">
<li>Kind of painful! but, nevertheless, possible. You have to do a lot more work figuring out the dimensions of the problem, how to setup the problem, keeping track of indices, etc&#x2026;  
</li>
</ol>

<p>
But, one day it might be helpful to know this can be done, e.g. to debug an installation, to validate an approach against known results, etc&#x2026;
</p>
<p>Copyright (C) 2013 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p><p><a href="/org/2013/05/21/Calling-lapack-directly-from-scipy.org">org-mode source</a><p>